app/controllers/asistencia_controller.rb

	def guardar
		form = params[:formulario]
		tabla = params[:tabla]
		ActiveRecord::Base.transaction do
			begin
				servicio = Servicio.find(form[:servicio])
				tabla.each do |y|
					x = y.last
					asist = Asistencia.create(
						:dat_asistencia_fecregistro => DateTime.now(),
						:dat_asistencia_fecasistencia => form[:fecha],
						:int_asistencia_categoria => x[:categoriaid],
						:int_asistencia_cantidad => x[:asistente],
						:servicio => servicio
						)
---
INSERT INTO "asistencia" ("created_at", "dat_asistencia_fecasistencia", "dat_asistencia_fecregistro", "int_asistencia_cantidad", "int_asistencia_categoria", "servicio_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "int_asistencia_id"