app/controllers/configuracion_controller.rb

SELECT "nivel_crecimientos".* FROM "nivel_crecimientos" WHERE "nivel_crecimientos"."int_nivelcrecimiento_escala" = -1 AND "nivel_crecimientos"."int_nivelcrecimiento_estadoactual" = 1 LIMIT 1
SELECT "ubigeos".* FROM "ubigeos" WHERE "ubigeos"."int_ubigeo_id" = $1 ORDER BY "ubigeos"."int_ubigeo_id" ASC LIMIT 1  [["int_ubigeo_id", 1360]]
---
  def recuperar_datos_generales
    data = {}
    iglesia = Iglesia.first
    pastor = NivelCrecimiento.find_by(:int_nivelcrecimiento_escala => -1, :int_nivelcrecimiento_estadoactual => 1).persona
    distrito = iglesia.ubigeo
    provincia = Ubigeo.find(distrito.int_ubigeo_dependencia)

SELECT "users".* FROM "users"
---
	def recuperar_usuario
		usuarios = User.all

SELECT "usuario_menus".* FROM "usuario_menus" WHERE "usuario_menus"."user_id" = 1
---
  def recuperar_menu_usuario
    usuarios_menus = UsuarioMenu.where("user_id" => params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1 FOR UPDATE  [["id", "1"]]
UPDATE "users" SET "email" = $1, "encrypted_password" = $2, "var_usuario_nombre" = $3, "var_usuario_apellido" = $4, "var_usuario_documento" = $5, "updated_at" = $6 WHERE "users"."id" = 1
INSERT INTO "usuario_menus" ("created_at", "menu_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "int_usuariomenu_id"  [["created_at", Sat, 13 Sep 2014 16:36:12 UTC +00:00], ["menu_id", 1], ["updated_at", Sat, 13 Sep 2014 16:36:12 UTC +00:00], ["user_id", 1]]
SELECT "menus".* FROM "menus" WHERE "menus"."var_menu_nombre" = 'persona' LIMIT 1
---
  def editar_usuario
  	ActiveRecord::Base.transaction do
			begin
        UsuarioMenu.destroy_all("user_id" => params[:id_usuario])
		  	user = User.lock.find(params[:id_usuario])
        if(params[:password] != "")
  		  	user.update!(
  		  				:email => params[:email],
  							:password => params[:password] ,
  							:var_usuario_nombre => params[:nombre],
  							:var_usuario_apellido => params[:apellido],
  							:var_usuario_documento => params[:num_doc])
        else
          user.update!(
                :email => params[:email],
                :var_usuario_nombre => params[:nombre],
                :var_usuario_apellido => params[:apellido],
                :var_usuario_documento => params[:num_doc])
        end

        if params[:permiso].is_a? String
        	UsuarioMenu.create!(
	  					:user => user,
	  					:menu => Menu.find_by(var_menu_nombre: params[:permiso])
	  					)

SELECT "lugars".* FROM "lugars"
---
	def recuperar_lugar
		lugar = Lugar.all

INSERT INTO "servicios" ("created_at", "int_servicio_tipo", "updated_at", "var_servicio_nombre") VALUES ($1, $2, $3, $4) RETURNING "int_servicio_id"  [["created_at", Thu, 30 Jan 2014 23:00:55 UTC +00:00], ["int_servicio_tipo", 1], ["updated_at", Thu, 30 Jan 2014 23:00:55 UTC +00:00], ["var_servicio_nombre", "Servicio 01"]]
INSERT INTO "turnos" ("created_at", "int_turno_dia", "servicio_id", "updated_at", "var_turno_horafin", "var_turno_horainicio") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "int_turno_id"
---
	def guardar_servicio
		ActiveRecord::Base.transaction do
			begin
				servicio = Servicio.new({:var_servicio_nombre => params[:nombre], :int_servicio_tipo => params[:tipo]})
				servicio.save!
				turno = Turno.new({:var_turno_horainicio => params[:hinicio],
					:var_turno_horafin => params[:hfin],
				 	:int_turno_dia => params[:dia], :servicio => servicio})
				turno.save!

SELECT "servicios".* FROM "servicios"
SELECT "turnos".* FROM "turnos" WHERE "turnos"."servicio_id" = 1 LIMIT 1
---
	def recuperar_servicio
		servicio = Servicio.all
		arrayserv = []
		servicio.each do |x|
			serv = {}
			serv['int_servicio_id'] = x.int_servicio_id
			serv['var_servicio_nombre'] = x.var_servicio_nombre
			serv['int_servicio_tipo'] = x.int_servicio_tipo
			if x.int_servicio_tipo == 1
				serv['int_servicio_tipo_desc'] = "Culto General"
			else
				serv['int_servicio_tipo_desc'] = "Culto Jovenes"
			end
			tshow= ""
			turno = Turno.find_by("servicio_id" => x.int_servicio_id)

SELECT "constantes".* FROM "constantes" WHERE (int_constante_clase = 2 and int_constante_valor > 0)
---
	def gettabla_categorias
		categoriaarray = Constante.where("int_constante_clase = 2 and int_constante_valor > 0")