app/controllers/ganar_controller.rb

INSERT INTO "personas" ("created_at", "dat_persona_bautismo", "dat_persona_fecNacimiento", "dat_persona_fecregistro", "iglesia_id", "int_persona_edad", "lugar_id", "updated_at", "var_persona_apellidos", "var_persona_dni", "var_persona_email", "var_persona_estado", "var_persona_invitado", "var_persona_nombres", "var_persona_ocupacion", "var_persona_profesion", "var_persona_sexo") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "int_persona_id"
SELECT "charts".* FROM "charts" WHERE "charts"."int_chart_anio" = 2012 AND "charts"."int_chart_mes" = 4 LIMIT 1 FOR UPDATE
UPDATE "charts" SET "int_chart_miembro" = $1, "updated_at" = $2 WHERE "charts"."int_chart_id" = 17  [["int_chart_miembro", 1], ["updated_at", Wed, 19 Feb 2014 22:02:18 UTC +00:00]]
---
	def guardar_miembro

		form = params[:formulario]
		tabla = params[:tabla]

		ActiveRecord::Base.transaction do
			begin
				persona = Persona.create({:dat_persona_fecregistro => form[:fec_conversion] ,
					:var_persona_nombres => form[:nombre] , :var_persona_apellidos => form[:apellido],
					:int_persona_edad => form[:edad] , :dat_persona_fecNacimiento => form[:fec_nac] ,
					:var_persona_profesion => form[:profesion] , :var_persona_ocupacion => form[:ocupacion],
					:var_persona_sexo => form[:sexo] , :var_persona_dni => form[:dni],
					:var_persona_estado => "1", :var_persona_email => form[:email] ,
					:dat_persona_bautismo => form[:fec_bautismo],
					:var_persona_invitado => form[:invitado] , :iglesia => Iglesia.first , :lugar => Lugar.find(form[:lugar]) })

				ch = Chart.lock.find_by(:int_chart_anio => persona.dat_persona_fecregistro.year,
				 :int_chart_mes => persona.dat_persona_fecregistro.month)

				if ch.nil? == false
					ch.int_chart_miembro = ch.int_chart_miembro + 1
					ch.save!

INSERT INTO "charts" ("created_at", "int_chart_anio", "int_chart_mes", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "int_chart_id"  [["created_at", Wed, 19 Feb 2014 22:02:18 UTC +00:00], ["int_chart_anio", 2012], ["int_chart_mes", 1], ["updated_at", Wed, 19 Feb 2014 22:02:18 UTC +00:00]]
---

					anio.each{ |i|

						metrica = Chart.create!( int_chart_anio: persona.dat_persona_fecregistro.year  , int_chart_mes: i )

INSERT INTO "direccions" ("created_at", "persona_id", "ubigeo_id", "updated_at", "var_direccion_descripcion", "var_direccion_estado", "var_direccion_referencia") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "int_direccion_id"
INSERT INTO "peticions" ("created_at", "dat_peticion_fecha", "persona_id", "updated_at", "var_peticion_motivooracion") VALUES ($1, $2, $3, $4, $5) RETURNING "int_peticion_id"
---
					:persona => persona , :dat_peticion_fecha => form[:fec_conversion]
					})

				direccion.save!
				nivel.save!
				peticion.save!

INSERT INTO "telefonos" ("created_at", "int_telefono_tipo", "persona_id", "updated_at", "var_telefono", "var_telefono_codigo") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "int_telefono_id"
---
						telefono = Telefono.new({:int_telefono_tipo => x[:tipo_val],
						:var_telefono_codigo => x[:codigo],
						:var_telefono => x[:tel], :persona => persona})
						telefono.save!

SELECT "telefonos".* FROM "telefonos" INNER JOIN "personas" ON "personas"."int_persona_id" = "telefonos"."persona_id" WHERE "telefonos"."persona_id" = 403
---
	def recuperar_persona_id
		persona = ActiveRecord::Base.connection.execute("SELECT * FROM view_get_persona_completo where int_persona_id="+params[:id])[0]
		telefono = Telefono.joins(:persona).where("persona_id" => params[:id])