app/controllers/informacion_controller.rb

    def recuperar_data_asistencia

        form = params[:formulario]
        data = nil
        mujj = 0
        muj = 0
        hom = 0
        homj = 0
        result = ""
        init = nil
        fint = nil

        #categorias = [ "Mu J." , "Hom J.", "Mu", "Hom"]
        categorias = []
        categoriaarray = Constante.where("int_constante_clase = 2 and int_constante_valor > 0")
---
SELECT "constantes".* FROM "constantes" WHERE (int_constante_clase = 2 and int_constante_valor > 0)


                    ini = s.first
                    fin = s.last
                    result_todo.push Diezmo.where(dat_diezmo_fecharegistro:( ini .. fin)).sum(:dec_diezmo_monto).to_f
---
SELECT SUM("diezmos"."dec_diezmo_monto") AS sum_id FROM "diezmos" WHERE ("diezmos"."dat_diezmo_fecharegistro" BETWEEN '2014-01-01 00:00:00' AND '2014-12-31 23:59:59')

                    ini = fecha.beginning_of_month
                    fin = fecha.end_of_month

                    result_todo.push Ofrenda.where(dec_ofrenda_fecharegistro:( ini .. fin)).sum(:dec_ofrenda_monto).to_f
---
SELECT SUM("ofrendas"."dec_ofrenda_monto") AS sum_id FROM "ofrendas" WHERE ("ofrendas"."dec_ofrenda_fecharegistro" BETWEEN '2014-01-01 00:00:00' AND '2014-12-31 23:59:59')

    def chart_miembro

        fecha = DateTime.now()

        todo = Chart.where("int_chart_anio" => fecha.year )
---
SELECT "charts".* FROM "charts" WHERE "charts"."int_chart_anio" = 2014

    def chart_visitante

        fecha = DateTime.now()

        todo = Chart.where("int_chart_anio" => fecha.year )
---
SELECT "charts".* FROM "charts" WHERE "charts"."int_chart_anio" = 2014

    def pie_chart_init

        visita = Chart.sum(:int_chart_visita, :conditions => [ "int_chart_anio =?",2013])
        miembro = Chart.sum(:int_chart_miembro, :conditions => [ "int_chart_anio =?",2013])
---
SELECT SUM("charts"."int_chart_visita") AS sum_id FROM "charts" WHERE (int_chart_anio =2013)
SELECT SUM("charts"."int_chart_miembro") AS sum_id FROM "charts" WHERE (int_chart_anio =2013)