app/controllers/ofrendas_controller.rb

SELECT "turnos".* FROM "turnos" WHERE "turnos"."servicio_id" = 0
---
	def recuperar_turno
		todo = []

		id = params[:id]

		result = Turno.where("servicio_id" => id )