app/controllers/serviciosgenerales_controller.rb

SELECT "personas".* FROM "personas"
---
	def personas_autocomplete
		persona = Persona.all

SELECT "constantes".* FROM "constantes" WHERE (int_constante_clase = 2 and int_constante_valor > 0)
---
	def getcategorias
		categorias = Constante.where("int_constante_clase = 2 and int_constante_valor > 0")

SELECT "turnos".* FROM "turnos" WHERE "turnos"."servicio_id" = 1 LIMIT 1
---
  def get_dia_servicio
    turno = Turno.find_by("servicio_id" => params[:idservicio])